import { BrowserType } from '@/utils';

const platform = BrowserType().system;

export default {
  privacy_policy_title: 'سياسة خاصة',
  privacy_policy_p_1: `مرحبًا بك في دردشة الفيديو ${
    platform === 'ios' ? 'a' : 'b'
  } live ("نحن"). نحن نتعهد على حفظ و احترام خصوصياتك.`,
  privacy_policy_p_2:
    'من خلال الوصول إلى مواقعنا الإلكترونية وخدماتنا وتطبيقاتنا ومنتجاتنا ومحتوياتنا أو استخدامها (بما في ذلك على سبيل المثال لا الحصر الأنظمة الأساسية) (يشار إليها مجتمعة باسم "الخدمات") ، تكون قد قرأت هذه السياسة وتفهمت حقوقك في معلوماتك وكيف سنجمعها ونستخدمها ومعالجتها. إذا كنت لا توافق على هذه السياسة أو أي جزء منها ، فلا يجب عليك استخدام خدماتنا. المصطلحات المكتوبة بحروف كبيرة والتي لم يتم تعريفها في هذه السياسة لها المعاني المعطاة لها من حيث المستخدم.',
  privacy_policy_p_3:
    'ذا كانت لديك أي أسئلة حول كيفية استخدامنا لمعلوماتك ، فيرجى الاتصال بنا من خلال خدمة العملاء عبر الإنترنت.',
  privacy_policy_subTitle_1: `نبذة مختصرة`,
  privacy_policy_p_4: `ما هي المعلومات التي نجمعها عنك؟`,
  privacy_policy_p_5: `نقوم بجمع المعلومات أثناء قيامك بإنشاء حسابك واستخدام النظام الأساسي ، مثل معلومات الاتصال الخاصة بك وما قمت بإنشائه وموقعك وتفاصيل بطاقة الائتمان. نقوم أيضًا بجمع معلومات حول موفري الشبكات الاجتماعية من الأطراف الثالثة الذين تشاركهم معنا ، بالإضافة إلى معلومات حول التكنولوجيا وسلوك استخدامك للمنصة. إذا سمحت لنا بالوصول إلى دليل الهاتف الخاص بك على جهازك المحمول ، فإننا نجمع أيضًا المعلومات الواردة في الرسائل التي ترسلها عبر منصتنا وجهات الاتصال الخاصة بك. معلومات اكثر.`,
  privacy_policy_p_6: `كيف سنستخدم معلوماتك؟`,
  privacy_policy_p_7: `نستخدم معلوماتك لأداء وتنفيذ عقود الخدمة الخاصة بنا معك ، وتحسين المنصة وإدارتها ، والسماح لك باستخدام وظائفها. نستخدم أيضًا معلوماتك لعرض الاقتراحات لك ، والترويج للمنصة ، وتقديم إعلانات خدمة مستهدفة لك. معلومات اكثر.`,
  privacy_policy_p_8: `مع من نشارك معلوماتك؟`,
  privacy_policy_p_9: `نشارك بياناتك مع مزودي الخدمة الخارجيين الذين نعتمد عليهم لمساعدتك في توفير نظام أساسي. يشمل هؤلاء الموفرون موفري التخزين السحابي ومقدمي خدمات تكنولوجيا المعلومات الآخرين. نشارك أيضًا معلوماتك مع شركائنا في العمل والمعلنين والتحليلات وموفري محركات البحث. يمكننا أيضًا مشاركة معلوماتك مع وكالات إنفاذ القانون أو السلطات العامة أو الوكالات الحكومية وفقًا لما يقتضيه القانون. معلومات اكثر.`,
  privacy_policy_p_10: `حقوقك`,
  privacy_policy_p_11: `قد يكون لديك حقوق تتعلق بمعلوماتك. معلومات اكثر.`,
  privacy_policy_p_12: `إلى متى سنحتفظ بمعلوماتك؟`,
  privacy_policy_p_13: `نحتفظ بمعلوماتك طالما أنه من الضروري (1) أداء التزاماتنا وحقوقنا التعاقدية فيما يتعلق بالمعلومات المعنية ، (2) التزاماتنا القانونية بموجب القوانين واللوائح المعمول بها للاحتفاظ بالبيانات لفترة زمنية معينة ، مع أخذ في الاعتبار المهل الزمنية المنصوص عليها في القانون المعمول به ؛ (3) أغراضنا التجارية المشروعة ؛ و (4) الدفاع عن النزاعات أو النزاعات المحتملة. معلومات اكثر.`,
  privacy_policy_p_14: `ذا طرأت أي تغييرات ، كيف سنبلغك بذلك؟`,
  privacy_policy_p_15: `سنقوم عادةً بإخطار جميع المستخدمين بأي تغييرات مهمة تطرأ على هذه السياسة من خلال إشعارات المنصة الخاصة بنا. ومع ذلك ، يجب عليك مراجعة هذه السياسة بشكل دوري للتحقق من أي تغييرات. سنقوم أيضًا بتحديث تاريخ "التحديث الأخير" في الجزء العلوي من هذه السياسة ، والذي يعكس تاريخ نفاذ السياسة. إذا واصلت زيارة الخدمة أو استخدامها بعد تاريخ تجديد السياسة ، فإنك تقبل سياسة التجديد. إذا كنت لا توافق على السياسة المحدثة ، فيجب عليك التوقف عن الوصول إلى الخدمة أو استخدامها`,
  privacy_policy_p_16: `أنواع المعلومات التي نجمعها`,
  privacy_policy_p_17: `قد نقوم بجمع واستخدام المعلومات التالية الخاصة بك:`,
  privacy_policy_p_18: `الرسالة التي قدمتها لنا. عندما تقوم بالتسجيل و / أو استخدام المنصة ، فإنك تزودنا بمعلومات عنك ، بما في ذلك اسمك ، وعمرك ، وجنسك ، وعنوانك ، وعنوان بريدك الإلكتروني ، وتفاصيل تسجيل الدخول إلى وسائل التواصل الاجتماعي ، ورقم الهاتف ، والمعلومات المالية ومعلومات بطاقة الائتمان ، وصورتك ، ولغتك خيار. بالإضافة إلى ذلك ، ستشمل هذه الفئة ملف تعريف العميل الخاص بك ، وتعليقاتك على نظامنا الأساسي (بما في ذلك أي عناصر افتراضية تقدمها لأي محتوى من إنشاء المستخدم) ، وتفاصيل الحساب والفوترة ، بما في ذلك على سبيل المثال لا الحصر حساب Apple أو Google أو Windows أو paypal أو حساب قناة دفع جهة خارجية أخرى (إذا لزم الأمر) لغرض الدفع النقدي أو سحبها. ويشمل أيضًا المحتوى الذي ينشئه المستخدم والصور ومحتوى الفيديو الذي تختار تشغيله على نظامنا الأساسي. يمكنك أيضًا استخدام بيانات اعتماد المستخدم الخاصة بك للتسجيل في بعض مواقع التواصل الاجتماعي ، مثل دردشة الفيديو المباشرة ${
    platform === 'ios' ? 'a' : 'b'
  } و twitter و Google. `,
  privacy_policy_p_19: `شبكة المعلومات التي تختار مشاركتها من مواقع التواصل الاجتماعي. إذا اخترت ربط شبكتك الاجتماعية أو حساب المنتدى العام (مثل ${
    platform === 'ios' ? 'a' : 'b'
  } live video chat و twitter و Google) بالمنصة ، فستوفر أو تسمح لشبكتك الاجتماعية بتزويدنا بمعلومات من شبكتك الاجتماعية أو حساب المنتدى العام ، بما في ذلك قائمة الاتصال الخاصة بك. ستتضمن هذه البيانات معلومات حول استخدامك للمنصة في هذه المنتديات العامة و / أو الشبكات الاجتماعية. لمزيد من المعلومات حول كيف ولأي غرض يعالج موفرو الشبكات الاجتماعية بياناتك ، يرجى الرجوع إلى سياسات الخصوصية الخاصة بهم.`,
  privacy_policy_p_20: `نقوم بجمع المعلومات الفنية عنك. عندما تستخدم النظام الأساسي ، سنجمع تلقائيًا بعض المعلومات الخاصة بك ، بما في ذلك عنوان IP الخاص بك ، والبيانات المتعلقة بالموقع (كما هو موضح أدناه) أو معرف جهاز فريد آخر ، وسجل التصفح الخاص بك (بما في ذلك ما تشاهده على النظام الأساسي) ، وملفات تعريف الارتباط (مثل المحددة أدناه) ، ومشغل الهاتف المحمول ، وإعدادات المنطقة الزمنية ، ومعلومات الهاتف المحمول أو الجهاز ، بما في ذلك طراز الجهاز ودقة الشاشة ، ونظام التشغيل والنظام الأساسي ، ومعلومات حول النظام الأساسي الخاص بك.`,
  privacy_policy_p_21: `نقوم بجمع معلومات حول سلوكك: نقوم أيضًا بجمع معلومات حول استخدامك للخدمة ، مثل تعليقاتك على منصتنا أو أي محتوى آخر أنشأه المستخدم ومحتوى فيديو تقوم بإنشائه وبثه عبر منصتنا. بالإضافة إلى ذلك ، سنستخدم بريدك الإلكتروني أو تفاصيل تسجيل الدخول إلى وسائل التواصل الاجتماعي لربط معلومات الاتصال أو المشترك الخاصة بك بأنشطتك على منصتنا. نجمع نتائج تفاعل المستخدم (مثل ، التعليق ، التكرار) ونتواصل مع المستخدمين بناءً على سلوكك. أخيرًا ، نقوم بجمع التفضيلات للاشتراك والتواصل.`,
  privacy_policy_p_22: `بيانات الموقع. عندما تستخدم النظام الأساسي على جهازك المحمول ، فقد نجمع معلومات حول موقعك. إذا سمحت ، يمكننا أيضًا جمع بيانات نظام تحديد المواقع العالمي (GPS) ومعلومات موقع الجهاز المحمول.`,
  privacy_policy_p_23: `معلومات من أطراف ثالثة. إذا كنت تستخدم أي موقع ويب آخر نقوم بتشغيله أو خدمات أخرى نقدمها ، فسوف نتلقى معلومات عنك من طرف ثالث. سوف نتلقى أيضًا معلومات من أطراف ثالثة ، مثل شبكات الإعلان وموفري التحليل ، وكذلك من مصادر أخرى ، بما في ذلك الكتالوجات التجارية وغيرها من المصادر التجارية أو العامة.`,
  privacy_policy_p_24: `هاتفك وجهات اتصال الدردشة المرئية المباشرة. يمكنك اختيار ما إذا كنت تريد العثور على مستخدمين آخرين للنظام الأساسي
  من خلال (I) جهات اتصال هاتفك أو (II) جهات اتصال الدردشة المرئية المباشرة ${
    platform === 'ios' ? 'a' : 'b'
  }. إذا اخترت العثور على مستخدمين آخرين من خلال جهات اتصال هاتفك المحمول ، فسنصل إلى جهات اتصال هاتفك ونجمعها ، بما في ذلك الاسم ورقم الهاتف والعنوان وأي معلومات أخرى حول جهات الاتصال التي قمت بتخزينها في هاتفك ، حتى نتمكن من تحديد ما إذا كانوا يستخدمون النظام الأساسي عن طريق مطابقتهم مع المستخدمين الحاليين للنظام الأساسي. إذا كنت ترغب في العثور على مستخدمين آخرين من خلال جهة اتصال الدردشة المرئية المباشرة في ${
    platform === 'ios' ? 'a' : 'b'
  } ، فسنجمع معلومات الدردشة المرئية المباشرة العامة الخاصة بك بالإضافة إلى اسم وملف تعريف جهة اتصال الدردشة المرئية المباشرة الخاصة بك.
 `,
  privacy_policy_p_25: `ترك رسالة. نقوم بجمع ومعالجة (بما في ذلك المسح الضوئي والتحليل) المعلومات التي تقدمها ، بما في ذلك أي معلومات شخصية ، بما في ذلك كتابة المعلومات أو إرسالها أو تلقيها (أي المحتوى والمعلومات حول وقت إرسال المعلومات و / أو تلقيها و / أو قراءتها والمشاركين في الاتصال) قدرات المراسلة لخدماتنا. يرجى ملاحظة أن الرسائل المرسلة إلى المستخدمين الآخرين لخدمتنا سيتم الوصول إليها من قبل مستخدمين آخرين ، ونحن لسنا مسؤولين عن الطريقة التي يستخدم بها هؤلاء المستخدمون المعلومات أو يفصحون عنها.`,
  privacy_policy_p_26: `البيانات الوصفية. عند تحميل مقطع فيديو على النظام الأساسي ("محتوى المستخدم") ، يتم تلقائيًا تحميل بعض البيانات الوصفية المرتبطة بمحتوى المستخدم. في الأساس ، تصف البيانات الوصفية البيانات الأخرى وتوفر معلومات حول محتوى المستخدم الذي لا يكون دائمًا واضحًا للمشاهد. فيما يتعلق بالفيديو الخاص بك ، يمكن أن تصف البيانات الوصفية كيف ومتى ومن يجمع محتوى المستخدم وكيفية تنسيقه. يتضمن أيضًا معلومات مثل اسم حسابك لتمكين المستخدمين الآخرين من تتبع مقاطع الفيديو إلى حساب المستخدم الخاص بك. تتضمن البيانات الوصفية أيضًا بيانات إضافية تختار توفيرها مع الفيديو ، مثل أي علامات تجزئة مستخدمة لوضع علامة على الفيديو أو الكلمات الأساسية للتعليق.`,
  privacy_policy_p_27: `شراء العملات المعدنية. يمكنك اختيار شراء حزمة العملات من خلال شراء التطبيق. يمكنك استخدام هذه القطع النقدية لشراء هدايا افتراضية وإرسالها إلى مستخدمين آخرين مباشرة أو على القناة. عندما تختار شراء عملات معدنية ، سيتم نقلك إلى متجر التطبيقات على جهازك المحمول لإتمام عملية الشراء. سنجمع معلوماتك الشخصية حول هذا الشراء. بالإضافة إلى ذلك ، إذا كنت تستخدم حساب Apple iTunes أو Google play لشراء أي نقاط هدايا وفقًا لسياسة نقاط الهدايا ، فسنقوم بمعالجة تأكيد الدفع ونضيفه إلى حسابك.`,
  privacy_policy_p_28: `كيف نستعمل معلوماتك`,
  privacy_policy_p_29: `سوف نستخدم المعلومات التي نجمعها عنك بالطرق التالية:`,
  privacy_policy_p_30: `إدارة النظام الأساسي (أي توفير الخدمات لك) والعمليات الداخلية ، بما في ذلك استكشاف الأخطاء وإصلاحها وتحليل البيانات والاختبار والبحث والإحصاءات وأغراض التحقيق (أي ضمان استقرار النظام الأساسي وسلامته) والتماس ملاحظاتك ؛`,
  privacy_policy_p_31: `يسمح لك بالمشاركة في الوظائف التفاعلية للمنصة ، عندما تختار القيام بذلك ؛`,
  privacy_policy_p_32: `إضفاء الطابع الشخصي على المحتوى الذي تتلقاه وتزويدك بمحتوى مخصص تهتم به ؛`,
  privacy_policy_p_33: `تحسين وتطوير المنصة وتنفيذ تطوير المنتجات ؛`,
  privacy_policy_p_34: `قياس وفهم فعالية إعلاناتنا بالنسبة لك وللآخرين ؛`,
  privacy_policy_p_35: `تقديم الخدمات لك وفقًا لإعدادات الدولة التي تختارها ، مثل الإعلانات والمحتويات الأخرى المتعلقة بإعدادات الدولة ؛`,
  privacy_policy_p_36: `تقديم الاقتراحات والاقتراحات لك ولمستخدمي النظام الأساسي الآخرين بشأن السلع أو الخدمات التي تهتم بها أو تهتم بها ؛`,
  privacy_policy_p_37: `السماح للمستخدمين الآخرين بالتعرف عليك كمستخدم خدمة من خلال وظيفة "العثور على أصدقاء آخرين" ، والسماح لك بالعثور على مستخدمين آخرين على النظام الأساسي والتواصل معهم ، ودعم الوظيفة الاجتماعية للخدمة ؛`,
  privacy_policy_p_38: `تزويدك بمعلومات ملفك الشخصي لإرسالها إلى أي شخص تختاره وتمكينك من المشاركة في النظام الأساسي والتفاعل مع مستخدمين آخرين ؛`,
  privacy_policy_p_39: `جعل معلوماتك متاحة للمستخدمين الآخرين وفقًا لإعدادات الخصوصية التي تختارها لمعلوماتك ؛`,
  privacy_policy_p_40: `أظهر لك ما تحب أو تتفاعل معه (عبر التعليقات و / أو عرض المحتوى) ، والمحتوى من منطقتك ، والمحتوى من المستخدمين الذين تتابعهم ؛`,
  privacy_policy_p_41: `تظهر لك الإعلانات المتعلقة بك ؛`,
  privacy_policy_p_42: `للترويج للخدمات ومعلومات الاستخدام التي تقدمها لنا ، مثل محتوى المستخدم ومحتوى الفيديو ، يمكنك اختيار البث على
  منصتنا كجزء من أنشطتنا الإعلانية والتسويقية للترويج للمنصة ؛
 `,
  privacy_policy_p_43: `لكي تعمل خدمة المراسلة بشكل صحيح (على الرغم من أنه لا يتم التعامل مع هذه المعلومات إلا إذا اخترت استخدام هذه الميزة) ، يمكنك اختيار حذف أي معلومات حول تقديرك من خلال وظيفة مسح ذاكرة التخزين المؤقت في إعدادات النظام الأساسي ، ومساعدتنا في اكتشاف إساءة الاستخدام ، الاحتيال والأنشطة غير القانونية على المنصة ؛`,
  privacy_policy_p_44: `تأكد من أنك كبير بما يكفي لاستخدام خدماتنا (كما يقتضي القانون).`,
  privacy_policy_p_45: `إبلاغك بالتغييرات التي تطرأ على خدماتنا ؛`,
  privacy_policy_p_46: `التواصل معك.`,
  privacy_policy_p_47: `تقديم دعم المستخدم لك ؛`,
  privacy_policy_p_48: `تنفيذ الشروط والأحكام والسياسات الخاصة بنا ؛`,
  privacy_policy_p_49: `يتم الدفع لك و / أو الدفع لك بموجب شروط Diamond and Flame المنصوص عليها في سياسة السلع الافتراضية ، أو بموجب شروط المستخدم أو اتفاقيات إنشاء المحتوى المتقدمة المنفصلة ، حسب الاقتضاء.`,
  privacy_policy_p_50: `كيف يمكننا مشاركة المعلومات الخاصة بك`,
  privacy_policy_p_51: `سوف نشارك معلوماتك مع الأطراف الثالثة المحددة التالية:`,
  privacy_policy_p_52: `شركاؤنا في العمل ، حتى نتمكن من تزويدك بخصومات خاصة من خلال المنصة ؛`,
  privacy_policy_p_53: `يحتاج المعلنون والشبكات الإعلانية إلى البيانات للاختيار`,
  privacy_policy_p_54_1: `اختر الإعلانات وقم بتقديمها لك وللآخرين. ؛`,
  privacy_policy_p_54_2: `يقوم موفرو التخزين السحابي بتخزين المعلومات وخدمات التعافي من الكوارث التي تقدمها ، وتنفيذ أي عقود وقعناها معك`,
  privacy_policy_p_55: `موفرو التحليل ومحركات البحث لمساعدتنا على تحسين النظام الأساسي وتحسينه ؛ ومقدمي خدمات تكنولوجيا المعلومات ؛`,
  privacy_policy_p_56: `مركز البيانات لدينا وخوادم مزود المضيف.`,
  privacy_policy_p_57: `سنقوم أيضًا بمشاركة معلوماتك مع أي عضو أو تابع للمجموعة ، وللأغراض المذكورة أعلاه فقط ، نساعد في تحسين النظام الأساسي وتحسينه لمنع الاستخدام غير القانوني ، وزيادة عدد المستخدمين ، وتطوير المعلومات وهندستها وتحليلها ، أو من أجل أغراض أعمالنا الداخلية (كيف نستخدم معلوماتك).`,
  privacy_policy_p_58: `إذا طُلب منا بموجب القانون مشاركة المعلومات مع هيئات عامة أخرى ، فسنستخدم بشكل معقول:`,
  privacy_policy_p_59: `الامتثال للالتزامات أو الإجراءات أو المتطلبات القانونية ؛`,
  privacy_policy_p_60: `فرض شروط المستخدم والاتفاقيات والسياسات والمعايير الأخرى الخاصة بنا ، بما في ذلك التحقيق في أي انتهاكات محتملة ؛`,
  privacy_policy_p_61: `كشف أو منع أو حل المشكلات الأمنية أو الاحتيال أو التقنية ؛ أو حماية حقوقنا أو ممتلكاتنا أو أمننا أو مستخدمينا أو الأطراف الثالثة أو الجمهور كما هو مطلوب أو يسمح به القانون (بما في ذلك تبادل المعلومات مع الشركات والمؤسسات الأخرى لمنع الاحتيال وتقليل مخاطر الائتمان).`,
  privacy_policy_p_62: `سنكشف أيضًا عن معلوماتك لأطراف ثالثة:`,
  privacy_policy_p_63: `إذا قمنا ببيع أو شراء أي عمل أو أصل ، في هذه الحالة سنكشف عن بياناتك للبائع أو المشتري المحتمل لتلك الأعمال أو الأصول ؛ أو`,
  privacy_policy_p_64: `إذا قمنا ببيع أو شراء أو دمج أو الاستحواذ أو التعاون مع شركات أو مؤسسات أخرى أو بيع جزء أو كل أصولنا. في هذا النوع من المعاملات ، ستكون معلومات المستخدم في الأصول المنقولة.`,
  privacy_policy_p_65: `حقوقك`,
  privacy_policy_p_66: `إذا قمت بالتسجيل للحصول على حساب ، فيمكنك الوصول إلى بعض المعلومات الشخصية التي تزودنا بها وتحديثها عن طريق تسجيل الدخول إلى حسابك على الإنترنت واستخدام الوظائف والميزات المتاحة هناك.`,
  privacy_policy_p_67: `يمكنك إلغاء الاشتراك في البريد الإلكتروني التسويقي أو الإعلاني باستخدام رابط أو آلية إلغاء الاشتراك المذكورة في البريد الإلكتروني التسويقي أو الإعلاني الذي نتلقاه.`,
  privacy_policy_p_68: `إذا كنت لا ترغب في مشاركة نظام تحديد المواقع العالمي (GPS) أو معلومات موقع الجهاز المحمول معنا ، فيمكنك إيقاف تشغيل وظيفة معلومات الموقع على جهازك المحمول.`,
  privacy_policy_p_69: `أمن المعلومات الخاصة بك`,
  privacy_policy_p_70: `سنتخذ تدابير لضمان التعامل مع معلوماتك بأمان ووفقًا لهذه السياسة. لسوء الحظ ، فإن نقل المعلومات عبر الإنترنت ليس آمنًا تمامًا. على الرغم من أننا سنبذل قصارى جهدنا لحماية معلوماتك ، على سبيل المثال من خلال التشفير ، لا يمكننا ضمان أمن المعلومات التي تنقلها عبر النظام الأساسي ؛ تتحمل أنت أي مخاطر انتقال.`,
  privacy_policy_p_71: `لدينا تدابير تقنية وتنظيمية مناسبة لضمان أن مستوى الأمان يتناسب مع احتمالية وشدة المخاطر التي تتعرض لها حقوق وحريات المستخدمين الآخرين. نحافظ على هذه التدابير الفنية والتنظيمية وسنراجعها من وقت لآخر لتحسين الأمان العام لنظامنا.`,
  privacy_policy_p_72: `من وقت لآخر ، سنقوم بتضمين روابط إلى شركائنا من الشبكات والمعلنين والمواقع التابعة. إذا كنت تستخدم روابط لهذه المواقع ، فيرجى ملاحظة أن هذه المواقع لها سياسات خصوصية خاصة بها ولا نتحمل أي مسؤولية أو مسؤولية عن هذه السياسات. يرجى مراجعة هذه السياسات قبل إرسال أي معلومات إلى هذه المواقع.`,
  privacy_policy_p_73: `لاحظ أنه إذا قمت بتحميل مقطع فيديو على النظام الأساسي لأول مرة ، فسيتم إخطارك بأنك تستخدم النظام الأساسي على حساب عام ، مما يعني أنه إذا قمت بنشر مقطع فيديو ، فسيكون مرئيًا لكل مستخدم للمنصة ، بغض النظر عن اتصالك بهذا المستخدم. يمكنك تقييد وصول الزوار إلى المعلومات الواردة في المعلومات المنشورة على المنصة وفقًا لإعدادات الخصوصية المحددة في نافذة المعلومات. سيتم تطبيق التغييرات على إعدادات الخصوصية على النظام الأساسي على الفور وستؤثر على المعلومات التي نشرتها في الماضي. بمجرد أن تقرر حذف UGV المقابل أو محتوى البث أو المعلومات الأخرى المتوفرة في ملفك الشخصي ، سنحذف معلوماتك من النظام الأساسي الذي تستخدمه.`,
  privacy_policy_p_74: `إلى متى نحتفظ بمعلوماتك`,
  privacy_policy_p_75: `نستخدم المعايير التالية لتحديد مدة الاحتفاظ بمعلوماتك:`,
  privacy_policy_p_76: `التزاماتنا وحقوقنا التعاقدية فيما يتعلق بالمعلومات المعنية ؛`,
  privacy_policy_p_77: `التزاماتنا وحقوقنا التعاقدية فيما يتعلق بالمعلومات المعنية ؛`,
  privacy_policy_p_78: `يطبق تحديد الإجراءات المنصوص عليها في القانون ؛`,
  privacy_policy_p_79: `أغراضنا التجارية المشروعة ؛ ونزاع أو نزاع محتمل.`,
  privacy_policy_p_80: `بعد إنهاء خدمتنا ، يمكننا تخزين معلوماتك بتنسيق مجمّع ومجهول الهوية. على الرغم مما ورد أعلاه ، يجوز لنا أيضًا الاحتفاظ بأي معلومات شخصية ضرورية بشكل معقول للامتثال لالتزاماتنا القانونية ، للسماح لنا بتسوية النزاعات والتقاضي بشأنها وإنفاذ اتفاقياتنا.`,
  privacy_policy_p_81: `المعلومات المتعلقة بالأطفال`,
  privacy_policy_p_82: `النظام الأساسي غير مخصص للأطفال دون سن 18 عامًا. إذا وجدنا أن شخصًا ما قد جمع معلومات شخصية من شخص أقل من 18 عامًا ، فسنحذف هذه المعلومات وننهي حساب هذا الشخص. إذا كنت تعتقد أننا جمعنا معلومات عن الأطفال دون سن 18 عامًا ، فيرجى الاتصال بنا من خلال التعليقات عبر الإنترنت.`,
  privacy_policy_p_83: `يتغيرون`,
  privacy_policy_p_84: `سنقوم عادةً بإخطار جميع المستخدمين بأي تغييرات مهمة تطرأ على هذه السياسة من خلال إشعارات المنصة الخاصة بنا. ومع ذلك ، يجب عليك مراجعة هذه السياسة بشكل دوري للتحقق من أي تغييرات. سنقوم أيضًا بتحديث تاريخ "التحديث الأخير" في الجزء العلوي من هذه السياسة ، والذي يعكس تاريخ نفاذ السياسة. إذا واصلت زيارة الخدمة أو استخدامها بعد تاريخ تجديد السياسة ، فإنك تقبل سياسة التجديد. إذا كنت لا توافق على السياسة المحدثة ، فيجب عليك التوقف عن الوصول إلى الخدمة أو استخدامها.`,
  privacy_policy_p_85: `في حالة وجود تعارض بين أحكام الشروط التكميلية (الاختصاص القضائي المحدد المتعلق بالولاية القضائية التي تصل فيها إلى الخدمة أو تستخدمها) وأجزاء أخرى من السياسة ، فإن الأحكام التكميلية (الاختصاص القضائي المحدد) للولاية القضائية ذات الصلة ستحل محل والسيطرة.`,
  privacy_policy_p_86: `أمن بياناتك الشخصية. ستتم حماية البيانات الشخصية التي تشاركها للخدمة وفقًا للسياسات والأنظمة المعتمدة من قبل الشركة.`,
  privacy_policy_p_87: `الاحتفاظ بالبيانات. لن نحتفظ بالبيانات أو البيانات الشخصية الحساسة لفترة أطول مما هو ضروري للاستخدام المشروع لهذه البيانات أو كما هو منصوص عليه في أي قانون قائم.`,
  privacy_policy_p_88: `معلومات عن الأطفال. النظام الأساسي غير مخصص للأشخاص الذين تقل أعمارهم عن 18 عامًا. لا يُسمح للمستخدمين الذين تقل أعمارهم عن 18 عامًا باستخدام النظام الأساسي أو تسجيل الحسابات على المنصة. سنزيل المعلومات الشخصية من هؤلاء الأشخاص الذين تقل أعمارهم عن 18 عامًا إذا تم اكتشافهم هناك. إذا كنت تعتقد أنه قد يكون لدينا بيانات شخصية أو نجمع معلومات حول الأشخاص الذين تقل أعمارهم عن 18 عامًا ، فيرجى الاتصال بنا على خدمة العملاء عبر الإنترنت.`,
  privacy_policy_p_89: `يحق لك الوصول إلى البيانات الشخصية التي نحتفظ بها عنك ومراجعتها ، وتصحيح أي بيانات شخصية غير دقيقة عنك ، وطلب حذف البيانات الشخصية التي تحتفظ بها عنك ، وطلب تعليق معالجة بياناتك الشخصية. يمكنك ممارسة حقوقك من خلال خدمة العملاء عبر الإنترنت.`,
  privacy_policy_p_90: `إندونيسيا. إذا كنت تستخدم خدماتنا في إندونيسيا ، فسيتم تطبيق الشروط الإضافية التالية. في حالة وجود أي تعارض بين الأحكام الإضافية التالية وأحكام موضوع سياسة الخصوصية هذه ، تسود الأحكام التالية.`,
  privacy_policy_p_91: `يتفق الآباء والأوصياء. إذا كان عمرك أقل من 21 عامًا وأقرت أنك حصلت على موافقة والديك أو الوصي القانوني ، فيمكنك`,
  privacy_policy_p_92: `استخدم الخدمة أو سجل حسابًا في الخدمة.`,
  privacy_policy_p_93: `إذن البيانات. لديك الحق في الوصول إلى البيانات الشخصية في منصتنا في أي وقت.`,
  privacy_policy_p_94: `تنويه. إذا فشلت الدردشة المرئية المباشرة من ${
    platform === 'ios' ? 'a' : 'b'
  } في الحفاظ على سرية بياناتك الشخصية على نظامنا الأساسي ، فسيقوم ${
    platform === 'ios' ? 'a' : 'b'
  } live video chat بإخطارك على الفور من خلال معلومات الاتصال التي قدمتها`,
  privacy_policy_p_95: `لغة. وثيقة التأمين مكتوبة باللغة الإنجليزية. يقر كل طرف بأنه قد قرأ وفهم هذه السياسة وأنه تم إجراؤها بحرية ودون إكراه. يجب أن يكون النص الرسمي لهذه السياسة باللغة الإنجليزية. يتفق الطرفان على أن الامتثال للقانون رقم 24 لعام 2009 لجمهورية إندونيسيا بشأن العلم الوطني واللغة والشعار والنشيد الوطني ("القانون رقم 24/2009") يجب أن ينطبق على هذه السياسة (وهي الاتفاقية التي بموجبها كيان إندونيسي هي حفلة). أنت تقر بأنك تفهم تمامًا لغة ومحتوى هذه السياسة وتوافق على أنك لن تستخدم أحكام القانون رقم 24/2009 لإبطال هذه السياسة.`,
  privacy_policy_p_96: `تغيير الشروط. تسود الشروط التالية على "التغييرات" المذكورة أعلاه: "يجوز لنا تعديل هذه السياسة من وقت لآخر إلى الحد الذي يسمح به القانون المعمول به. إذا قمنا بتعديل هذه السياسة ، فسنخطرك بتاريخ سريان التغيير بحلول (أنا ) نشر إشعار على صفحة تسجيل الدخول لموقعنا على الويب أو الشاشة الأولية لتطبيق الهاتف المحمول لدينا ؛ أو (2) معلومات الاتصال التي تقدمها لنا. إذا لم تعترض صراحةً على السياسة المعدلة ، حتى لو أبلغناك ، يعتبر عدم القيام بذلك خلال فترة الإشعار المذكورة أعلاه موافقًا على التغيير وسيتم اعتبارك موافقًا على السياسة الجديدة ". "`,
  privacy_policy_p_97: `يتفق الآباء والأوصياء. إذا كان عمرك 13 عامًا ولكنك أقل من 20 عامًا ، فأنت تقر أنك حصلت على موافقة والديك أو الوصي القانوني على استخدام هذه المنصات أو تسجيل الحسابات عليها.`,
  privacy_policy_p_98: `معلومات. فيما يتعلق بما ورد أعلاه (فيما يتعلق "بالمعلومات" في "أنواع المعلومات التي نجمعها") ، تنطبق الشروط الإضافية التالية: لا يجوز لأي شخص قراءة معلوماتك ما لم تكن مطلوبة بموجب القوانين واللوائح المعمول بها. الغرض من هذه الوظيفة هو اكتشاف إساءة الاستخدام والاحتيال والأنشطة غير القانونية على المنصة. يمكنك إيقاف هذا في أي وقت بالذهاب إلى @ ${
    platform === 'ios' ? 'a' : 'b'
  }-live video chat123.com。`,
  privacy_policy_p_99: `كيف نشارك ملف التعريف الخاص بك. على الرغم من المعلومات المذكورة أعلاه (كيف نشارك بياناتك الشخصية) ، في اليابان ، نحن نشارك بياناتك الشخصية فقط مع جهات خارجية مختارة مدرجة على وجه التحديد في هذا القسم. بالنسبة للعملاء في اليابان ، تظل الدردشة المرئية المباشرة ${
    platform === 'ios' ? 'a' : 'b'
  } مسؤولة بشكل أساسي عن حماية معلوماتك. `,
};
